app/controllers/rides_controller.rb

SELECT "rides".* FROM "rides"
---
  def index
    @rides = Ride.all

SELECT  "rides".* FROM "rides" WHERE "rides"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @ride = Ride.find(params[:id])